13xforever.language-x86-64-assembly
a5huynh.vscode-ron
alefragnani.project-manager
amoosbr.markdown-nomnoml
bierner.emojisense
bierner.markdown-mermaid
bmalehorn.vscode-fish
bungcip.better-toml
dbaeumer.vscode-eslint
DotJoshJohnson.xml
eamodio.gitlens
earshinov.permute-lines
EditorConfig.EditorConfig
formulahendry.auto-close-tag
Fudge.auto-using
GitHub.vscode-pull-request-github
humao.rest-client
joaompinto.asciidoctor-vscode
joaompinto.vscode-graphviz
k--kato.docomment
keyring.Lua
marclipovsky.string-manipulation
matklad.rust-analyzer
michaelgriscom.leadermode
mitchdenny.ecdc
ms-dotnettools.csharp
ms-vscode.cpptools
ms-vscode.wordcount
mtxr.sqltools
octref.vetur
raidou.calc
redhat.vscode-yaml
robertrossmann.remedy
sagebind.mathpad
sandcastle.vscode-open
slevesque.vscode-hexdump
stkb.rewrap
streetsidesoftware.code-spell-checker
vadimcn.vscode-lldb
xoronic.pestfile
Yukai.map-replace-js
yzhang.markdown-all-in-one
