tap "acsandmann/tap"
tap "SoloAntonio/cartero"
tap "supersonic-app/supersonic"

brew "btop"
brew "coreutils"
brew "docker-buildx"
brew "docker-compose"
brew "docker"
brew "exiftool"
brew "fish"
brew "gifsicle"
brew "gnu-sed"
brew "gnu-tar"
brew "kubernetes-cli"
brew "lftp"
brew "media-info"
brew "parallel"
brew "rename"
brew "ripgrep"
brew "stow"
brew "watch"
brew "zenity"

cask "cartero"
cask "font-hurmit-nerd-font"
cask "font-symbols-only-nerd-font"
cask "jordanbaird-ice"
cask "kitty"
cask "localsend"
cask "middleclick"
cask "supersonic"
cask "swiftbar"
