tap "buildkite/buildkite"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "pulumi/tap"
tap "supersonic-app/supersonic"
tap "widen/brew", "git@github.com:Widen/brew"

brew "aws-vault"
brew "btop"
brew "cmake"
brew "coreutils"
brew "dive"
brew "docker-buildx"
brew "docker-compose"
brew "docker"
brew "exiftool"
brew "fish"
brew "gifsicle"
brew "gnu-sed"
brew "gnu-tar"
brew "groovy"
brew "jpeg-xl"
brew "kubernetes-cli"
brew "lftp"
brew "media-info"
brew "mise"
brew "node"
brew "parallel"
brew "qpdf"
brew "rename"
brew "ripgrep"
brew "stow"
brew "watch"
brew "webp"
brew "xidel"
brew "yarn"
brew "zenity"
brew "buildkite/buildkite/bk@3"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "pulumi/tap/pulumi"
brew "widen/brew/local-nginx"
brew "widen/brew/slipway"

cask "1password-cli"
cask "flox"
cask "font-hurmit-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "kitty"
cask "middleclick"
cask "modern-csv"
cask "ngrok"
cask "supersonic"
cask "swiftbar"

vscode "13xforever.language-x86-64-assembly"
vscode "avarayr.synthwave-refined"
vscode "biomejs.biome"
vscode "bmalehorn.vscode-fish"
vscode "dnut.rewrap-revived"
vscode "dontshavetheyak.groovy-guru"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jnoortheen.nix-ide"
vscode "kdl-org.kdl"
vscode "kdl-org.kdl-v1"
vscode "marclipovsky.string-manipulation"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mitchdenny.ecdc"
vscode "mrmlnc.vscode-scss"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "pest.pest-ide-tools"
vscode "platformio.platformio-ide"
vscode "rangav.vscode-thunder-client"
vscode "richie5um2.vscode-sort-json"
vscode "robbowen.synthwave-vscode"
vscode "rogalmic.vscode-xml-complete"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
